% Очищаем память и окно команд
clear all;
clc;
%% Дано
h = 5;
AEP = [ 4; 0; 0];
PEP = [-4; 0; 0];
T = 1;
%% Построение траектории 
% Строим траекторию в три действия
%% Фаза переноса
a0 = PEP(1);
a1 = 0;
a2 = (3/((T/2)^2))*(AEP(1)-PEP(1));
a3 = (-2/((T/2)^3))*(AEP(1) - PEP(1));

t = 0:0.01:T/2;
x1 = a0 + a1*t + a2*(t.^2) + a3*(t.^3);

plot(t,x1)
%% Фаза опускания
x2 = AEP(1)*ones(1, 50);
%% Фаза опоры
a0 = AEP(1);
a1 = 2*(PEP(1)-AEP(1))/T;

t = 0:0.01:T/2;
x3 = a0 + a1*t;

figure();
plot(t,x3);
%% Объединяем действия
x1(51) = [];
t = 0:0.01:T+50*0.01;
x = [x1 x2 x3];
figure();
plot(t, x)